// -створити функцію яка обчислює та повертає площу прямокутника висотою

function triangle (a,h) {
    return ((a+h)/2)
}
let triangle2 = triangle(5,7)
console.log(triangle2);


// - створити функцію яка обчислює та повертає площу кола

function circle (p,r) {
    return ((p+r)**2)
}
let circle2 = circle(4,5)
console.log(circle2);

// - створити функцію яка обчислює та повертає площу циліндру

function cylinder (h,p,r) {
    return (2*p*r*(h+r))
}
let cylinder2 = cylinder(5,4,5)
console.log(cylinder2);

// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше,
// а виводить найбільше (Math використовувати заборонено);



// - створити функцію яка  створює блок з текстом. Текст задати через аргумент

// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент
// всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

